# Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр.

# Пример:

# - 6782 -> 23
# - 0,56 -> 11

# num =float(input("Введите число: "))
# sum = 0
# while (num != 0):
#     p = num%10
#     sum = sum+p
#     num = num//10
# print(f"Сумма цифр = {sum}")

# Напишите программу, которая принимает на вход число N и выдает набор произведений чисел от 1 до N.

# Пример:

# - пусть N = 4, тогда [ 1, 2, 6, 24 ] (1, 1*2, 1*2*3, 1*2*3*4)

# n = int(input("Введите число: "))
 
# factorial = 1
 
# for i in range(2, n+1):
#     factorial *= i
 
# print(factorial)





